# <%= variables.figManaged %>
#
brew "ack"
brew "cmake"
brew "cscope"
brew "fzf"
brew "gdbm"
brew "gettext"
brew "icu4c"
brew "jq"
brew "libtermkey"
brew "libtool"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "lua"
brew "luajit"
brew "macvim"
brew "neovim"
brew "node"
brew "openssl@1.1"
brew "pcre2"
brew "perl"
brew "pkg-config"
brew "python@3.8"
brew "readline"
brew "ripgrep"
brew "ruby"
brew "sqlite"
brew "unibilium"
brew "yarn"

<%- if (variables.profile === 'work') { -%>
brew "msodbcsql17"
brew "mssql-tools"
brew "msgpack"
brew "msodbcsql"
brew "postgresql"
<%- } -%>

cask "docker"
cask "font-hack"
cask "iterm2"
cask "karabiner-elements"
cask "rectangle"
